wisteria-1c/Конфигурация/Catalogs/ВидыЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказНарядов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ВидыЗаказНарядов/Forms/ФормаСпискаЭтапов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов") Тогда
		Элементы.ФормаПодобратьСостояние.Видимость = Ложь;
	КонецЕсли;
	
	ВидЗаказа = Параметры.ВидЗаказа;
	
	ИспользоватьВидыЗаказНарядов = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов") Тогда
		Заголовок = СтрШаблон(Заголовок, Строка(ВидЗаказа));
	Иначе
		Заголовок = НСтр("ru='Состояния заказа-наряда'");				
	КонецЕсли;
	
	СписокСостояний.Параметры.УстановитьЗначениеПараметра("ВидЗаказа", ВидЗаказа);
	
	СохранитьГлобальныеНастройки();
	ИзменитьТекстЗапросаПоПараметрам(Параметры);
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СостоянияЗаказНарядов" Тогда
		
		Если Параметр.Свойство("ЭтоНовый") И Параметр.Свойство("Ссылка") И Параметр.ЭтоНовый Тогда
			Если Источник.ВладелецФормы = Элементы.СписокЭтапов Тогда
				ДобавитьСостояниеЗаказа(ВидЗаказа, Параметр.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
		УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЭтапов

&НаКлиенте
Процедура СписокЭтаповОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ДобавитьСостояниеЗаказа(ВидЗаказа, ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокЭтаповПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		Данные = СтрокаСписка.Значение.Данные;
		СтрокаПредставления = Строка(Данные.НомерСтроки) + ". " + Данные.Наименование;  
		Данные.ПредставлениеНаименования = СтрокаПредставления;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьСостояние(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
		
	ОткрытьФорму("Справочник.СостоянияЗаказНарядов.ФормаВыбора", ПараметрыФормы, Элементы.СписокЭтапов);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	
	ПереместитьЭлемент(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	
	ПереместитьЭлемент(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеПроцессов(Команда) 
	ПараметрыПроцессов = Новый Структура;
	ПараметрыПроцессов.Вставить("НастройкаПроцессов", Истина);
	ПараметрыПроцессов.Вставить("Ключ", ВидЗаказа);
	ОткрытьФорму("Справочник.ВидыЗаказНарядов.Форма.ФормаЭлемента", ПараметрыПроцессов);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьТекстЗапросаПоПараметрам(Параметры)
	
	Если Не Параметры.Свойство("ОтображатьСостоянияЗаявок") И ЗаявкиИспользуются Тогда
		
		СписокСостояний.ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СостоянияЗаказНарядов.Ссылка КАК Ссылка,
			|	СостоянияЗаказНарядов.Наименование КАК Наименование,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеНаименования,
			|	ВидыЗаказНарядовПорядокСостояний.НомерСтроки КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА СостоянияЗаказНарядов.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказНарядов.Завершен)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Порядок
			|ИЗ
			|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
			|		ПО СостоянияЗаказНарядов.Ссылка = ВидыЗаказНарядовПорядокСостояний.Состояние
			|ГДЕ
			|	ВидыЗаказНарядовПорядокСостояний.Ссылка = &ВидЗаказа
			|	И ВидыЗаказНарядовПорядокСостояний.НомерСтроки > ВидыЗаказНарядовПорядокСостояний.Ссылка.НомерСостоянияЗаявки";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	ЗаявкиИспользуются = РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(
	СписокСостояний.КомпоновщикНастроек.Настройки.УсловноеОформление,
	Метаданные.Справочники.СостоянияЗаказНарядов.ПолноеИмя(),
	"Ссылка",
	Элементы.ПредставлениеНаименования.Имя);
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеСостоянияЗавершен(
	СписокСостояний.КомпоновщикНастроек.Настройки.УсловноеОформление,
	ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен"));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСостояниеЗаказа(ВидЗаказа, СостояниеЗаказа)
	
	Если ВидЗаказа.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", СостояниеЗаказа)).Количество() > 0 Тогда				
		Возврат;		
	КонецЕсли;
	
	ВидЗаказаОбъект = ВидЗаказа.ПолучитьОбъект();	
	ВидЗаказаОбъект.Заблокировать();
	НоваяСтрока = ВидЗаказаОбъект.ПорядокСостояний.Добавить();
	НоваяСтрока.Состояние = СостояниеЗаказа;
	ВидЗаказаОбъект.Записать();
		
	Элементы.СписокЭтапов.Обновить();
			
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлемент(Смещение)
	
	Если Не ЗначениеЗаполнено(Элементы.СписокЭтапов.ТекущаяСтрока)
		Или Элементы.СписокЭтапов.ТекущаяСтрока = ПредопределенноеЗначение("Справочник.СостоянияЗаказНарядов.Завершен") Тогда
		
		Возврат;
	КонецЕсли;
	
	СостоянияЗаказовВызовСервера.ПереместитьСостояние(ВидЗаказа,
		Элементы.СписокЭтапов.ТекущаяСтрока,
		Смещение);
	Элементы.СписокЭтапов.Обновить();
	
	Оповестить("Запись_ВидыЗаказНарядов", ВидЗаказа, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ФормаПодобратьСостояние, КоманднаяПанель);
	Элементы.ГруппаКолонки.Группировка = ГруппировкаКолонок.ВЯчейке;
	
КонецПроцедуры

#КонецОбласти
